clc;
clear all;
%% Входные параметры
f0 = 100000;%---------------Частота сигнала(Гц)
fg = 2000000;%--------------Опорная частота платы L-502(Гц)
fd = 2000000;%--------------Частота дискретизации АЦП(Гц)
Fi = 0;%--------------------Фаза сигнала
A = 1;%---------------------Амплитуда сигнала(А)
T = 0.1;%----------------Т выгрузки из буфера одного блока(Сек)
fDAC = fg/2;%---------------Частота дискретизации ЦАП
%%
Point = fd/f0;%-------------Количество точек на период в оцифрованном сигнале при заданных настройках
N = T/(1/fd);%--------------Кол-во слов в блоке(cлово 32bit) 
Td = 1/fd;%-----------------Период дискретизации АЦП
%%
max_absciss = 30*10^-6;%----До какого 'х' строить график по оси абсцисс в секундах
t = 0:Td/4:T;
n = 0:N-1;
cnt = ceil(max_absciss*9000000);%------------------Сколько точек строить
nn = (n/fd);
nnn = n/(fDAC);
s = A * sin(2*pi*f0*t+Fi);
q = A * sin(2*pi*f0*n*Td+Fi);
Ss = q;
%% Аналоговый сигнал
subplot(3,1,1); plot(t(1:cnt),s(1:cnt),'k','LineWidth',1);
axis([0 max_absciss -A A ]);
grid on;
title('Аналоговый сигнал');
xlabel('Время в секундах');
ylabel('Амплитуда(B)'); 
%% Оцифрованный сигнал(АЦП)
subplot(3,1,2); plot(nn(1:ceil(max_absciss/Td)+1),q(1:ceil(max_absciss/Td)+1),'b-s','LineWidth',1,'MarkerSize',10,'MarkerEdgeColor','b', 'MarkerFaceColor',[0.5,0.5,0.5]);
axis([0 max_absciss -A A ]);
grid on;
title('Оцифрованный сигнал(АЦП)');
xlabel('Время в секундах');
ylabel('Амплитуда(B)'); 
%% Преобразованный сигнал(ЦАП)
subplot(3,1,3); plot(nnn(1:ceil(max_absciss/Td)+1),Ss(1:ceil(max_absciss/Td)+1),'r-s','MarkerSize',10,'MarkerEdgeColor','b','LineWidth',1,'MarkerFaceColor',[0.5,0.5,0.5]);
axis([0 max_absciss -A A ]);
grid on;
title('Преобразованный сигнал(ЦАП)');
xlabel('Время в секундах');
ylabel('Амплитуда(B)'); 
%% 
text(10^-5,19,'Справочная инфо') 